// -----// IR Dump After mlir::iree_compiler::IREE::HAL::AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After AutoInputConversionPipeline (iree-auto-input-conversion) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After IREEImportPublic (iree-import-public) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After ImportMLProgram (iree-import-ml-program) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After SanitizeModuleNames (iree-sanitize-module-names) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::ConvertStreamableOpsPass (iree-abi-convert-streamable-ops) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1] -> (s0 ceildiv s1)>
#map1 = affine_map<()[s0, s1] -> (s0 * s1)>
#map2 = affine_map<(d0)[s0, s1] -> (-d0 + s1, s0)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
    %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
    %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
    %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
    %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
    %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
    %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
    %c0 = arith.constant 0 : index
    %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
    %c1 = arith.constant 1 : index
    %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
    %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
    return %7 : !hal.buffer_view
  }
  func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%dim, %workgroup_count_0]
      %3 = affine.apply #map1()[%workgroup_id_0, %2]
      %4 = affine.apply #map1()[%workgroup_id_0, %2]
      %5 = affine.min #map2(%3)[%2, %dim]
      %6 = affine.min #map2(%4)[%2, %dim_0]
      %extracted_slice = tensor.extract_slice %arg0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %7 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%5, %6, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %7 into %0[%3, %4] [%5, %6] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %5 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %6 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%4, %5, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %6 into %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>
#map1 = affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>
#map2 = affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
    %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
    %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
    %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
    %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
    %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
    %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
    %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
    %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
    return %7 : !hal.buffer_view
  }
  func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%workgroup_id_0, %dim, %workgroup_count_0]
      %3 = affine.apply #map()[%workgroup_id_0, %dim, %workgroup_count_0]
      %4 = affine.min #map1()[%dim, %workgroup_id_0, %workgroup_count_0]
      %5 = affine.min #map2()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
      %extracted_slice = tensor.extract_slice %arg0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %6 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%4, %5, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %6 into %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %5 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %6 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%4, %5, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %6 into %0[%2, %3] [%4, %5] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>
#map1 = affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>
#map2 = affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
    %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
    %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
    %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
    %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
    %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
    %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
    %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
    %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
    return %7 : !hal.buffer_view
  }
  func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%workgroup_id_0, %dim, %workgroup_count_0]
      %3 = affine.min #map1()[%dim, %workgroup_id_0, %workgroup_count_0]
      %4 = affine.min #map2()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
      %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#executable_target_embedded_elf_x86_64_ = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "generic", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128", native_vector_size = 16 : index, target_triple = "x86_64-unknown-unknown-eabi-elf", ukernels = false}>
#map = affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>
#map1 = affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>
#map2 = affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>
#device_target_llvm_cpu = #hal.device.target<"llvm-cpu", {executable_targets = [#executable_target_embedded_elf_x86_64_]}>
module attributes {hal.device.targets = [#device_target_llvm_cpu]} {
  func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
    %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
    %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
    %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
    %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
    %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
    %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
    %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
    %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
    return %7 : !hal.buffer_view
  }
  func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
    %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
    %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
    %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
      %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
      %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
      %2 = affine.apply #map()[%workgroup_id_0, %dim, %workgroup_count_0]
      %3 = affine.min #map1()[%dim, %workgroup_id_0, %workgroup_count_0]
      %4 = affine.min #map2()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
      %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
      %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
      %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
      flow.return %inserted_slice : tensor<?x?xf32>
    } count(%arg2: index) -> (index, index, index) {
      flow.return %arg2, %c1, %c1 : index, index, index
    }
    return %1 : tensor<?x?xf32>
  }
}


// -----// IR Dump After RemoveZeroExtentTensors (iree-flow-remove-zero-extent-tensors) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After RemoveZeroExtentTensors (iree-flow-remove-zero-extent-tensors) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After DetachElementwiseFromNamedOps (iree-flow-detach-elementwise-from-named-ops) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After DetachElementwiseFromNamedOps (iree-flow-detach-elementwise-from-named-ops) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
    %workgroup_count_0 = flow.dispatch.workgroup.count[0] : index
    %2 = affine.apply affine_map<()[s0, s1, s2] -> (s0 * (s1 ceildiv s2))>()[%workgroup_id_0, %dim, %workgroup_count_0]
    %3 = affine.min affine_map<()[s0, s1, s2] -> (s0 - s1 * (s0 ceildiv s2), s0 ceildiv s2)>()[%dim, %workgroup_id_0, %workgroup_count_0]
    %4 = affine.min affine_map<()[s0, s1, s2, s3] -> (s0 - s1 * (s2 ceildiv s3), s2 ceildiv s3)>()[%dim_0, %workgroup_id_0, %dim, %workgroup_count_0]
    %extracted_slice = tensor.extract_slice %arg0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_1 = tensor.extract_slice %arg1[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %extracted_slice_2 = tensor.extract_slice %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> to tensor<?x?xf32>
    %5 = iree_codegen.ukernel.generic "aie_matmul_f32" ins(%extracted_slice, %extracted_slice_1 : tensor<?x?xf32>, tensor<?x?xf32>) outs(%extracted_slice_2 : tensor<?x?xf32>) (%3, %4, %workgroup_id_0 : index, index, index) fn_def_attrs {hal.import.fields = ["processor_id", "processor_data"]} strided_outer_dims(0) -> tensor<?x?xf32>
    %inserted_slice = tensor.insert_slice %5 into %0[%2, %2] [%3, %4] [1, 1] : tensor<?x?xf32> into tensor<?x?xf32>
    flow.return %inserted_slice : tensor<?x?xf32>
  } count(%arg2: index) -> (index, index, index) {
    flow.return %arg2, %c1, %c1 : index, index, index
  }
  return %1 : tensor<?x?xf32>
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-flow-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @matmul_aie_offload(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %0 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[0] : index
  %1 = hal.buffer_view.dim<%arg0 : !hal.buffer_view>[1] : index
  %2 = hal.tensor.import %arg0 "input 0" : !hal.buffer_view -> tensor<?x?xf32>{%0, %1}
  %3 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[0] : index
  %4 = hal.buffer_view.dim<%arg1 : !hal.buffer_view>[1] : index
  %5 = hal.tensor.import %arg1 "input 1" : !hal.buffer_view -> tensor<?x?xf32>{%3, %4}
  %6 = call @_matmul_aie_offload(%2, %5) : (tensor<?x?xf32>, tensor<?x?xf32>) -> tensor<?x?xf32>
  %dim = tensor.dim %6, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %6, %c1 : tensor<?x?xf32>
  %7 = hal.tensor.export %6 "output 0" : tensor<?x?xf32>{%dim, %dim_0} -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-flow-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func private @_matmul_aie_offload(%arg0: tensor<?x?xf32>, %arg1: tensor<?x?xf32>) -> tensor<?x?xf32> {
  %c0 = arith.constant 0 : index
  %c1 = arith.constant 1 : index
  %c2 = arith.constant 2 : index
  %dim = tensor.dim %arg0, %c0 : tensor<?x?xf32>
  %dim_0 = tensor.dim %arg0, %c1 : tensor<?x?xf32>
  %0 = tensor.empty(%dim, %dim_0) : tensor<?x?xf32>
  %1 = flow.dispatch.region[%c2] -> (tensor<?x?xf32>{%dim, %dim_0}) {
    %workgroup_id_0 = flow.dispatch.workgroup.id[0] : index
